// 031. Вывести на экран кубы чисел от 1 до N

int N;
double K;
int c=1;
Console.Write("Введите число N: ");
N=Convert.ToInt32(Console.ReadLine());
    while(c<=N)
    {
        Console.WriteLine(K=Math.Pow(c,3)); 
        c++; 
    }


